Tekla.Structures.Model.Detail
The Detail class represents a detail. A detail is different from a connection since the detail only connects to one part.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using Tekla.Structures;
using System;
public class Example
{
public void Example1()
{
Beam B = new Beam(new Point(13000,3000,-500), new Point(13000,3000,6000));
B.Profile.ProfileString = "HEA400";
B.Material.MaterialString = "S235JR";
if(B.Insert())
{
Detail D = new Detail();
D.Name = "Test End Plate Detail";
D.Number = 1002;
D.LoadAttributesFromFile("standard");
D.UpVector = new Vector(0,0,0);
D.PositionType = PositionTypeEnum.MIDDLE_PLANE;
D.AutoDirectionType = AutoDirectionTypeEnum.AUTODIR_DETAIL;
D.DetailType = DetailTypeEnum.END;
D.SetPrimaryObject(B);
D.SetReferencePoint(new Point(13000,3000,3000));
D.SetAttribute("el", 33.0);
D.SetAttribute("er", 33.0);
if(!D.Insert())
{
Console.WriteLine("Detail Insert failed");
}
else
{
Console.WriteLine(D.Identifier.ID);
Double DValue = 0.0;
if(!D.GetAttribute("er", ref DValue) || DValue != 33)
Console.WriteLine("Detail GetAttribute failed");
}
}
}
}

Tekla.Structures.Model.Detail.Class
The class of the detail.

Tekla.Structures.Model.Detail.UpVector
A vector indicating which direction is considered the up direction.

Tekla.Structures.Model.Detail.AutoDirectionType
The auto direction type. Default value is AUTODIR_DETAIL.
Value should be AUTODIR_NA to set direction with UpVector property.
Value should be AUTODIR_FROM_ATTRIBUTE_FILE to set direction with detail attribute file.

Tekla.Structures.Model.Detail.PositionType
The position type.

Tekla.Structures.Model.Detail.DetailType
The detail type.

Tekla.Structures.Model.Detail.Code
The code of the detail. The code can be used to classify the detail.
The code can be reported and shown in drawings.
The maximum length of the string is 20 characters.

Tekla.Structures.Model.Detail.Status
The read only status of the detail.
The status can be reported and shown in drawings.
The color of the detail symbol in the model indicates the status of the detail.

Tekla.Structures.Model.Detail.#ctor
Creates a new detail instance.

Tekla.Structures.Model.Detail.SetPrimaryObject(Tekla.Structures.Model.ModelObject)
Sets the detail's primary object.
M: The primary object.
Returns: True on success.

Tekla.Structures.Model.Detail.GetPrimaryObject
Returns the primary object.
Returns: The primary object of the detail.

Tekla.Structures.Model.Detail.SetReferencePoint(Tekla.Structures.Geometry3d.Point)
Sets the reference point; the point the user would pick for the detail to appear to.
ReferencePoint: The reference point.
Returns: True on success.

Tekla.Structures.Model.Detail.GetReferencePoint
Returns the reference point.
Returns: The reference point.

Tekla.Structures.Model.Detail.Insert
Inserts the detail into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.Detail.Select
Selects a detail from the model database. The detail ID must be set.
Returns: True on success.

Tekla.Structures.Model.Detail.Modify
Modifies the existing detail in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.Detail.Delete
Deletes the detail instance with the given ID from the model database.
Returns: True on success.